===
.EDA. Brackets around whole term or just the name
===
LIST primeNumbers = (two = 2), (three) = 3, (five = 5)
---

(ink
  (content_block
    (list
      (identifier)
      (list_values
        (lv_init
          (lv_assign
            (identifier)
            (number)))
        (lv_assign
          (lv_init
            (identifier))
          (number))
        (lv_init
          (lv_assign
            (identifier)
            (number)))))))

===
.EDB. Assigning multiple values
===
~ DoctorsInSurgery = (Adams, Bernard)
~ DoctorsInSurgery = (Adams, Bernard, Eamonn)
~ DoctorsInSurgery = ()
---

(ink
  (content_block
    (code
      (assignment
        (identifier)
        (list_values
          (identifier)
          (identifier))))
    (code
      (assignment
        (identifier)
        (list_values
          (identifier)
          (identifier)
          (identifier))))
    (code
      (assignment
        (identifier)
        (list_values)))))

===
.EDC. Testing for containment
===
{ DoctorsInSurgery ? (Adams, Bernard):
	Dr Adams and Dr Bernard are having a hushed argument in one corner.
- DoctorsInSurgery has Eamonn:
	Dr Eamonn is polishing his glasses.
- DoctorsInSurgery !? (Adams, Bernard):
- DoctorsInSurgery hasnt (Adams, Bernard):
- SomeList ? ():
- Facts ? (Fogg_is_English, Fogg_is_fairly_odd):
}
---

(ink
  (content_block
    (cond_block
      (cond_arm
        (binary
          (identifier)
          (list_values
            (identifier)
            (identifier)))
        (text))
      (cond_arm
        (binary
          (identifier)
          (identifier))
        (text))
      (cond_arm
        (binary
          (identifier)
          (list_values
            (identifier)
            (identifier))))
      (cond_arm
        (binary
          (identifier)
          (list_values
            (identifier)
            (identifier))))
      (cond_arm
        (binary
          (identifier)
          (list_values)))
      (cond_arm
        (binary
          (identifier)
          (list_values
            (identifier)
            (identifier)))))))

===
.EDD. Nicer list printing
===

LIST favouriteDinosaurs = (stegosaurs), brachiosaur, (anklyosaurus), (pleiosaur)

My favourite dinosaurs are {listWithCommas(favouriteDinosaurs, "all extinct")}.

=== function listWithCommas(list, if_empty)
    {LIST_COUNT(list):
    - 2:
        	{LIST_MIN(list)} and {listWithCommas(list - LIST_MIN(list), if_empty)}
    - 1:
        	{list}
    - 0:
			{if_empty}
    - else:
      		{LIST_MIN(list)}, {listWithCommas(list - LIST_MIN(list), if_empty)}
    }
---

(ink
  (content_block
    (list
      (identifier)
      (list_values
        (lv_init
          (identifier))
        (identifier)
        (lv_init
          (identifier))
        (lv_init
          (identifier))))
    (content
      (text)
      (eval
        (call
          (identifier)
          (args
            (identifier)
            (string))))
      (text)))
  (knot_block
    (knot
      (identifier)
      (params
        (identifier)
        (identifier)))
    (content_block
      (cond_block
        (cond_arm
          (call
            (identifier)
            (args
              (identifier))))
        (cond_arm
          (number)
          (content
            (eval
              (call
                (identifier)
                (args
                  (identifier))))
            (text)
            (eval
              (call
                (identifier)
                (args
                  (binary
                    (identifier)
                    (call
                      (identifier)
                      (args
                        (identifier))))
                  (identifier))))))
        (cond_arm
          (number)
          (eval (identifier)))
        (cond_arm
          (number)
          (eval (identifier)))
        (cond_arm
          (else)
          (content
            (eval
              (call
                (identifier)
                (args
                  (identifier))))
            (text)
            (eval
              (call
                (identifier)
                (args
                  (binary
                    (identifier)
                    (call
                      (identifier)
                      (args
                        (identifier))))
                  (identifier))))))))))

===
.EDE. Pedantic example
===
My favourite dinosaur{LIST_COUNT(favouriteDinosaurs) != 1:s} {isAre(favouriteDinosaurs)} {listWithCommas(favouriteDinosaurs, "all extinct")}.
---

(ink
  (content_block
    (content
      (text)
      (conditional_text
        (binary
          (call
            (identifier)
            (args
              (identifier)))
          (number))
        (text))
      (eval
        (call
          (identifier)
          (args
            (identifier))))
      (eval
        (call
          (identifier)
          (args
            (identifier)
            (string))))
      (text))))

===
.EDF. Intersecting Lists
===
{desiredValues ^ actualValues: The new president has at least one desirable quality.}

{LIST_COUNT(desiredValues ^ actualValues) == 1: Correction, the new president has only one desirable quality. {desiredValues ^ actualValues == self_belief: It's the scary one.}}
---

(ink
  (content_block
    (conditional_text
      (binary
        (identifier)
        (identifier))
      (text))
    (conditional_text
      (binary
        (call
          (identifier)
          (args
            (binary
              (identifier)
              (identifier))))
        (number))
      (content
        (text)
        (conditional_text
          (binary
            (binary
              (identifier)
              (identifier))
            (identifier))
          (text))))))
