===
.AHA. Alternatives: Sequences
===
The radio hissed into life. {"Three!"|"Two!"|"One!"|There was the white noise racket of an explosion.|But it was just static.}

{I bought a coffee with my five-pound note.|I bought a second coffee for my friend.|I didn't have enough money to buy any more coffee.}
---

(ink
  (paragraph
    (text)
    (alternatives
      (content
        (text))
      (content
        (text))
      (content
        (text))
      (content
        (text))
      (content
        (text))))
  (paragraph
    (alternatives
      (content
        (text))
      (content
        (text))
      (content
        (text)))))

===
.AHAa. Corner Case: Curly braces and pipes can be escaped
===
\{One\|Three\}
{One|Two\|or so|Three}
---

(ink
  (paragraph
    (text))
  (paragraph
    (alternatives
      (content
        (text))
      (content
        (text))
      (content
        (text)))))

===
.AHB. Alternatives: Cycles
===
It was {&Monday|Tuesday|Wednesday|Thursday|Friday|Saturday|Sunday} today.
---

(ink
  (paragraph
    (text)
    (alternatives
      (content
        (text))
      (content
        (text))
      (content
        (text))
      (content
        (text))
      (content
        (text))
      (content
        (text))
      (content
        (text)))
    (text)))

===
.AHC. Alternatives: Once Only
===
He told me a joke. {!I laughed politely.|I smiled.|I grimaced.|I promised myself to not react again.}
---

(ink
  (paragraph
    (text)
    (alternatives
      (content
        (text))
      (content
        (text))
      (content
        (text))
      (content
        (text)))))

===
.AHD. Alternatives: Shuffle
===
I tossed the coin. {~Heads|Tails}.
---

(ink
  (paragraph
    (text)
    (alternatives
      (content
        (text))
      (content
        (text)))
    (text)))

===
.AHE. Alternatives: Blank elements
===
I took a step forward. {!||||Then the lights went out. -> eek}
---

(ink
  (paragraph
    content: (text)
    content: (alternatives
      (content
        content: (text)
        redirect: (divert
          target: (identifier))))))

===
.AHF. Alternatives Can Be Nested
===
The Ratbear {&{wastes no time and |}swipes|scratches} {&at you|into your {&leg|arm|cheek}}.
---

(ink
  (paragraph
    (text)
    (alternatives
      (content
        (alternatives
          (content
            (text)))
        (text))
      (content
        (text)))
    (alternatives
      (content
        (text))
      (content
        (text)
        (alternatives
          (content
            (text))
          (content
            (text))
          (content
            (text)))))
    (text)))

===
.AHG. Alternatives Inside Choice Text
===
+ 	"Hello, {&Master|Monsieur Fogg|you|brown-eyes}_"[] I declared.
---

(ink
  (choice_block
    header: (choice
      marks: (choice_marks
        (choice_mark))
      main: (content
        content: (text)
        content: (alternatives
          (content
            content: (text))
          (content
            content: (text))
          (content
            content: (text))
          (content
            content: (text)))
        content: (text))
      choice_only: (choice_only)
      when_chosen: (content
        content: (text)))))

===
.AHH. Alternatives Starting Choice Text
===
+\	{&They headed towards the Sandlands|They set off for the desert|The party followed the old road South}
---

(ink
  (choice_block
    header: (choice
      marks: (choice_marks
        (choice_mark))
      main: (content
        content: (text)
        content: (alternatives
          (content
            content: (text))
          (content
            content: (text))
          (content
            content: (text)))))))

===
.AHI. Conditional Text
===
{met_blofeld: "I saw him. Only for a moment. His real name was {met_blofeld.learned_his_name: Franz|kept a secret}." | "I missed him. Was he particularly evil?" }

---

(ink
  (paragraph
    content: (conditional_text
      condition: (identifier)
      (content
        content: (text)
        content: (conditional_text
          condition: (qualified_name
            (identifier)
            (identifier))
          (content
            content: (text))
          (content
            content: (text)))
        content: (text))
      (content
        content: (text)))))

===
.AHJa. Inline Logic syntax: Minimal distinguishing examples
===
{identifier}  // eval
{sequence|}  // a pipe means it's an alternative
{still+sequence|}  // a pipe STILL means it's an alternative, even if it *looks* like an expression
{condition:this|}  // a colon and then a pipe means it _might_ be conditional text (but note next test)
---

(ink
  (paragraph
    (eval
      (identifier)))
  (line_comment)
  (paragraph
    (alternatives
      (content
        (text))))
  (line_comment)
  (paragraph
    (alternatives
      (content
        (text))))
  (line_comment)
  (paragraph
    (conditional_text
      (identifier)
      (content
        (text))))
  (line_comment))

===
.AHJb. Distinguishing between expression and text
===
{this or that:result|}  // there is a valid expression before the colon
{this is that:result|}  // `is` is not an operator, therefore the whole run is treated as text
---

(ink
  (paragraph
    (conditional_text
      (binary
        (identifier)
        (identifier))
      (content
        (text))))
  (line_comment)
  (paragraph
    (alternatives
      (content
        (text))))
  (line_comment))

===
.AHJc. Paranthesized expressions directly after opening brace
===
{(a + b|}
{(a + b)|}
// NOTE: This is NOT how the ink compiler works! It needs parens to be balanced in this position!
---

(ink
  (paragraph
    (alternatives
      (content
        (text))))
  (paragraph
    (alternatives
      (content
        (text))))
  (line_comment))

===
.AHJd. Prefix expressions
===
{not a|b}
{not a:a|b}
---

(ink
  (alternatives
    (content
      (text))
    (content
      (text)))
  (conditional_text
    (unary
      (identifier))
    (content
      (text))))

===
.AHJe. Genuine ambiguities with pipes (the first could be eval, but this is how the ink compiler interprets these)
===
{a||2}
{a|||2}
{a||||2}
---

(ink
  (paragraph
    (alternatives
      (content
        (text))
      (content
        (text))))
  (paragraph
    (alternatives
      (content
        (text))
      (content
        (text))))
  (paragraph
    (alternatives
      (content
        (text))
      (content
        (text)))))

===
.AHJf. Booleans and words can conflict
===
{true|}
{true}
---

(ink
  (paragraph
    (alternatives
      (content
        (text))))
  (paragraph
    (eval
      (boolean))))
